"ハッシュ"
"ハッシュとリテラルの例"
a = {"foo1" => 1, "foo2" => 2, "foo3" => 1}
a["foo1"] #=> 1
a["foo2"] = 20
p a #=> {"foo1"=>1, "foo2"=>20, "foo3"=>1}

"存在しないキーを指定"
a = {}
a[:foo1] #=> nil

"キーシンプル用いたハッシュ"
a = {:foo1 => 1, :foo2 => 2, :foo3 => 1}
a = {foo1: 1, foo2: 2, foo3: 1}
a[:foo1] #=> 1


"ハッシュのデフォルト値の指定"
a = Hash.new(5)

p a #=> {}
a[:foo1] #=> 5


"[]によるハッシュの生成"
# Hashのクラスメソッド[]から生成する方法
a = Hash[:foo1, "a", :foo2, 2, :foo3, 3]

# Array#to_hから生成する方法, どちらも同じ結果になります。
a = [[:foo1, 1], [:foo2, 2], [:foo3, 3]].to_h
a[:foo1] #=> 1 

"ハッシュ引数"

"波カッコを戦略しない場合"
def foo a, b, c
  c
end

foo(1, 2, :foo1 => 1, :foo2 => 2) #=> {:foo1=>1, :foo2=>2}
