"範囲"
Range class
"範囲リテラル"
# 1から10以下の範囲
1..10
# aからz以下の範囲
"a".."z"
# 1から10未満の範囲 
1...10 

"例"
(1..10).each do |i|
 p i
end # 1 2 3 4 5 6 7 8 9 10

(1...10).each do |i|
  p i
end # 1 2 3 4 5 6 7 8 9


"include?メソッド"
== # 同値判定
=== # 包含判定　（包み含むこと）
(1..5).include?(3) #=> true
(1..5).include?(5) #=> true
(1..5) == 3 #=> false
(1..5) === 5 #=> true
(1..5) === 9 #=> false

"for式に範囲オプジェクトを適用"
for i in "a".."z"
  p i
end # aからzまで


"配列の文字演算に範囲オプジェクトを適用"
a = ["a", "b", "c", "d", "e"]
p a[2, 3] #=> ["c", "d", "e"] 
p a[2..3] #=> ["c", "d"] {a[2]からa[3]}
p a[2...3] #=> ["c"] {a[2]からa[3]ただa[3]含めない}


"文字列の文字演算に範囲オプジェクトを適用"
a = "abcde"
p a[1] #=> "b" 
p a[2..3] #=> "cd"
p a[2...3] #=> "c"

"case式"
